knieriem/tinygo-stm32-svd/svd/stm32mp157.svd
        <register>
          <name>DTDR1</name>
          <displayName>DTDR1</displayName>
          <description>DDRPHYC DTD register 1</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x7788BB44</resetValue>
          <fields>
            <field>
              <name>DTBYTE4</name>
              <description>DTBYTE4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DTBYTE5</name>
              <description>DTBYTE5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DTBYTE6</name>
              <description>DTBYTE6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DTBYTE7</name>
              <description>DTBYTE7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR0</name>
          <displayName>GPR0</displayName>
          <description>DDRPHYC general purpose register 0</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPR0</name>
              <description>GPR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR1</name>
          <displayName>GPR1</displayName>
          <description>DDRPHYC general purpose register 1</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPR1</name>
              <description>GPR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ZQ0CR0</name>
          <displayName>ZQ0CR0</displayName>
          <description>DDRPHYC ZQ0C register 0</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000014A</resetValue>
          <fields>
            <field>
              <name>ZDATA</name>
              <description>ZDATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
            <field>
              <name>ZDEN</name>
              <description>ZDEN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ZCALBYP</name>
              <description>ZCALBYP</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ZCAL</name>
              <description>ZCAL</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ZQPD</name>
              <description>ZQPD</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ZQ0CR1</name>
          <displayName>ZQ0CR1</displayName>
          <description>DDRPHYC ZQ0CR1 register</description>
          <addressOffset>0x184</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x0000007B</resetValue>
          <fields>
            <field>
              <name>ZPROG</name>
              <description>ZPROG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ZQ0SR0</name>
          <displayName>ZQ0SR0</displayName>
          <description>DDRPHYC ZQ0S register 0</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000014A</resetValue>
          <fields>
            <field>
              <name>ZCTRL</name>
              <description>ZCTRL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
            <field>
              <name>ZERR</name>
              <description>ZERR</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ZDONE</name>
              <description>ZDONE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ZQ0SR1</name>
          <displayName>ZQ0SR1</displayName>
          <description>DDRPHYC ZQ0S register 1</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ZPD</name>
              <description>ZPD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ZPU</name>
              <description>ZPU</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OPD</name>
              <description>OPD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OPU</name>
              <description>OPU</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DX0GCR</name>
          <displayName>DX0GCR</displayName>
          <description>DDRPHYC byte lane 0 GC register</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000EE81</resetValue>
          <fields>
            <field>
              <name>DXEN</name>
              <description>DXEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSODT</name>
              <description>DQSODT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQODT</name>
              <description>DQODT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DXIOM</name>
              <description>DXIOM</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DXPDD</name>
              <description>DXPDD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DXPDR</name>
              <description>DXPDR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSRPD</name>
              <description>DQSRPD</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSEN</name>
              <description>DSEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DQSRTT</name>
              <description>DQSRTT</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQRTT</name>
              <description>DQRTT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTTOH</name>
              <description>RTTOH</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RTTOAL</name>
              <description>RTTOAL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>R0RVSL</name>
              <description>R0RVSL</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DX0GSR0</name>
          <displayName>DX0GSR0</displayName>
          <description>DDRPHYC byte lane 0 GS register 0</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTDONE</name>
              <description>DTDONE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERR</name>
              <description>DTERR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIERR</name>
              <description>DTIERR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTPASS</name>
              <description>DTPASS</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DX0GSR1</name>
          <displayName>DX0GSR1</displayName>
          <description>DDRPHYC byte lane 0 GS register 1</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DFTERR</name>
              <description>DFTERR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSDFT</name>
              <description>DQSDFT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RVERR</name>
              <description>RVERR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RVIERR</name>
              <description>RVIERR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RVPASS</name>
              <description>RVPASS</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DX0DLLCR</name>
          <displayName>DX0DLLCR</displayName>
          <description>DDRPHYC byte lane 0 DLLC register</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>SFBDLY</name>
              <description>SFBDLY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SFWDLY</name>
              <description>SFWDLY</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MFBDLY</name>
              <description>MFBDLY</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MFWDLY</name>
              <description>MFWDLY</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SSTART</name>
              <description>SSTART</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SDPHASE</name>
              <description>SDPHASE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ATESTEN</name>
              <description>ATESTEN</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDLBMODE</name>
              <description>SDLBMODE</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLLSRST</name>
              <description>DLLSRST</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLLDIS</name>
              <description>DLLDIS</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DX0DQTR</name>
          <displayName>DX0DQTR</displayName>
          <description>DDRPHYC byte lane 0 DQT register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DQDLY0</name>
              <description>DQDLY0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DQDLY1</name>
              <description>DQDLY1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DQDLY2</name>
              <description>DQDLY2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DQDLY3</name>
              <description>DQDLY3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DQDLY4</name>
              <description>DQDLY4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DQDLY5</name>
              <description>DQDLY5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DQDLY6</name>
              <description>DQDLY6</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DQDLY7</name>
              <description>DQDLY7</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DX0DQSTR</name>
          <displayName>DX0DQSTR</displayName>
          <description>DDRPHYC byte lane 0 DQST register</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x3DB02000</resetValue>
          <fields>
            <field>
              <name>R0DGSL</name>
              <description>R0DGSL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>R0DGPS</name>
              <description>R0DGPS</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DQSDLY</name>
              <description>DQSDLY</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DQSNDLY</name>
              <description>DQSNDLY</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DMDLY</name>
              <description>DMDLY</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DX1GCR</name>
          <displayName>DX1GCR</displayName>
          <description>DDRPHYC byte lane 1 GC register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000EE81</resetValue>
          <fields>
            <field>
              <name>DXEN</name>
              <description>DXEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSODT</name>
              <description>DQSODT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQODT</name>
              <description>DQODT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DXIOM</name>
              <description>DXIOM</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DXPDD</name>
              <description>DXPDD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DXPDR</name>
              <description>DXPDR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSRPD</name>
              <description>DQSRPD</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSEN</name>
              <description>DSEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DQSRTT</name>
              <description>DQSRTT</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQRTT</name>
              <description>DQRTT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTTOH</name>
              <description>RTTOH</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RTTOAL</name>
              <description>RTTOAL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>R0RVSL</name>
              <description>R0RVSL</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DX1GSR0</name>
          <displayName>DX1GSR0</displayName>
          <description>DDRPHYC byte lane 1 GS register 0</description>
          <addressOffset>0x204</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTDONE</name>
              <description>DTDONE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERR</name>
              <description>DTERR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIERR</name>
              <description>DTIERR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTPASS</name>
              <description>DTPASS</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DX1GSR1</name>
          <displayName>DX1GSR1</displayName>
          <description>DDRPHYC byte lane 1 GS register 1</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DFTERR</name>
              <description>DFTERR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSDFT</name>
              <description>DQSDFT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RVERR</name>
              <description>RVERR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RVIERR</name>
              <description>RVIERR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RVPASS</name>
              <description>RVPASS</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
