knieriem/tinygo-stm32-svd/svd/stm32mp157.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GICV</name>
      <description>GICV</description>
      <groupName>GICV</groupName>
      <baseAddress>0xA0026000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTLR</name>
          <displayName>CTLR</displayName>
          <description>GICV virtual machine control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLEGRP0</name>
              <description>ENABLEGRP0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLEGRP1</name>
              <description>ENABLEGRP1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKCTL</name>
              <description>ACKCTL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIQEN</name>
              <description>FIQEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBPR</name>
              <description>CBPR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOIMODE</name>
              <description>EOIMODE</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMR</name>
          <displayName>PMR</displayName>
          <description>GICV VM priority mask register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY</name>
              <description>PRIORITY</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BPR</name>
          <displayName>BPR</displayName>
          <description>GICV VM binary point register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>BINARY_POINT</name>
              <description>BINARY_POINT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IAR</name>
          <displayName>IAR</displayName>
          <description>GICV VM interrupt acknowledge register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>INTERRUPT_ID</name>
              <description>INTERRUPT_ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EOIR</name>
          <displayName>EOIR</displayName>
          <description>GICV VM end of interrupt register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EOIINTID</name>
              <description>EOIINTID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPR</name>
          <displayName>RPR</displayName>
          <description>GICV VM running priority register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000FF</resetValue>
          <fields>
            <field>
              <name>PRIORITY</name>
              <description>PRIORITY</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HPPIR</name>
          <displayName>HPPIR</displayName>
          <description>GICV VM highest priority pending interrupt register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>PENDINTID</name>
              <description>PENDINTID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ABPR</name>
          <displayName>ABPR</displayName>
          <description>GICV VM aliased binary point register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>BINARY_POINT</name>
              <description>BINARY_POINT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AIAR</name>
          <displayName>AIAR</displayName>
          <description>GICV VM aliased interrupt register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>INTERRUPT_ID</name>
              <description>INTERRUPT_ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AEOIR</name>
          <displayName>AEOIR</displayName>
          <description>GICV VM aliased end of interrupt register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EOIINTID</name>
              <description>EOIINTID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHPPIR</name>
          <displayName>AHPPIR</displayName>
          <description>GICV VM aliased highest priority pending interrupt register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>PENDINTID</name>
              <description>PENDINTID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APR0</name>
          <displayName>APR0</displayName>
          <description>The GICV_APR0 is an alias of GICH_APR.</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>APR0</name>
              <description>APR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IIDR</name>
          <displayName>IIDR</displayName>
          <description>The GICV_IIDR is an alias of GICC_IIDR.</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0102143B</resetValue>
          <fields>
            <field>
              <name>IIDR</name>
              <description>IIDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR</name>
          <displayName>DIR</displayName>
          <description>GICV VM deactivate interrupt register</description>
          <addressOffset>0x1000</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERRUPT_ID</name>
              <description>INTERRUPT_ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CPUID</name>
              <description>CPUID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
