knieriem/tinygo-stm32-svd/svd/stm32mp157.svd
        <register>
          <name>MP_APRSTCR</name>
          <displayName>MP_APRSTCR</displayName>
          <description>This register is used to control the behavior of the warm reset. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00007F00</resetValue>
          <fields>
            <field>
              <name>RDCTLEN</name>
              <description>RDCTLEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTTO</name>
              <description>RSTTO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_APRSTSR</name>
          <displayName>MP_APRSTSR</displayName>
          <description>This register provides a status of the RDCTL. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RSTTOV</name>
              <description>RSTTOV</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR</name>
          <displayName>BDCR</displayName>
          <description>This register is used to control the LSE function. Wait states are inserted in case of successive write accesses to this register. The number of wait states may be up to 7 cycles of AHB4 clock.After a system reset, the register RCC_BDCR is write-protected. In order to modify this register, the DBP bit in the PWR control register 1 (PWR_CR1) has to be set to . Bits of RCC_BDCR register are only reset after a backup domain reset: nreset_vsw (see Section10.3.6: Backup domain reset). Any other internal or external reset will not have any effect on these bits.This register is located into the VSW domain. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>LSEON</name>
              <description>LSEON</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSEBYP</name>
              <description>LSEBYP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSERDY</name>
              <description>LSERDY</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIGBYP</name>
              <description>DIGBYP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSEDRV</name>
              <description>LSEDRV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSECSSON</name>
              <description>LSECSSON</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSECSSD</name>
              <description>LSECSSD</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTCSRC</name>
              <description>RTCSRC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTCCKEN</name>
              <description>RTCCKEN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSWRST</name>
              <description>VSWRST</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDLSICR</name>
          <displayName>RDLSICR</displayName>
          <description>This register is used to control the minimum NRST active duration and LSI function.0 to 7 wait states are inserted for word, half-word and byte accesses. Wait states are inserted in case of successive accesses to this register.This register is reset by the por_rst reset, and it is located into the VDD domain. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSION</name>
              <description>LSION</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>LSIRDY</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRD</name>
              <description>MRD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EADLY</name>
              <description>EADLY</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE</name>
              <description>SPARE</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB4RSTSETR</name>
          <displayName>APB4RSTSETR</displayName>
          <description>This register is used to activate the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  activates the reset of the corresponding peripheral.</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LTDCRST</name>
              <description>LTDCRST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSIRST</name>
              <description>DSIRST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDRPERFMRST</name>
              <description>DDRPERFMRST</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBPHYRST</name>
              <description>USBPHYRST</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB4RSTCLRR</name>
          <displayName>APB4RSTCLRR</displayName>
          <description>This register is used to release the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  releases the reset of the corresponding peripheral.</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LTDCRST</name>
              <description>LTDCRST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSIRST</name>
              <description>DSIRST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDRPERFMRST</name>
              <description>DDRPERFMRST</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBPHYRST</name>
              <description>USBPHYRST</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB5RSTSETR</name>
          <displayName>APB5RSTSETR</displayName>
          <description>This register is used to activate the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  activates the reset of the corresponding peripheral. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI6RST</name>
              <description>SPI6RST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C4RST</name>
              <description>I2C4RST</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C6RST</name>
              <description>I2C6RST</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1RST</name>
              <description>USART1RST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STGENRST</name>
              <description>STGENRST</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB5RSTCLRR</name>
          <displayName>APB5RSTCLRR</displayName>
          <description>This register is used to release the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  releases the reset of the corresponding peripheral. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI6RST</name>
              <description>SPI6RST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C4RST</name>
              <description>I2C4RST</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C6RST</name>
              <description>I2C6RST</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1RST</name>
              <description>USART1RST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STGENRST</name>
              <description>STGENRST</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB5RSTSETR</name>
          <displayName>AHB5RSTSETR</displayName>
          <description>This register is used to activate the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  activates the reset of the corresponding peripheral. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPIOZRST</name>
              <description>GPIOZRST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRYP1RST</name>
              <description>CRYP1RST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HASH1RST</name>
              <description>HASH1RST</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG1RST</name>
              <description>RNG1RST</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXIMCRST</name>
              <description>AXIMCRST</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB5RSTCLRR</name>
          <displayName>AHB5RSTCLRR</displayName>
          <description>This register is used to release the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  releases the reset of the corresponding peripheral. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPIOZRST</name>
              <description>GPIOZRST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRYP1RST</name>
              <description>CRYP1RST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HASH1RST</name>
              <description>HASH1RST</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG1RST</name>
              <description>RNG1RST</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXIMCRST</name>
              <description>AXIMCRST</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB6RSTSETR</name>
          <displayName>AHB6RSTSETR</displayName>
          <description>This register is used to activate the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  activates the reset of the corresponding peripheral.</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPURST</name>
              <description>GPURST</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETHMACRST</name>
              <description>ETHMACRST</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMCRST</name>
              <description>FMCRST</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPIRST</name>
              <description>QSPIRST</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC1RST</name>
              <description>SDMMC1RST</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC2RST</name>
              <description>SDMMC2RST</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC1RST</name>
              <description>CRC1RST</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBHRST</name>
              <description>USBHRST</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB6RSTCLRR</name>
          <displayName>AHB6RSTCLRR</displayName>
          <description>This register is used to release the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  releases the reset of the corresponding peripheral.</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ETHMACRST</name>
              <description>ETHMACRST</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMCRST</name>
              <description>FMCRST</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPIRST</name>
              <description>QSPIRST</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC1RST</name>
              <description>SDMMC1RST</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC2RST</name>
              <description>SDMMC2RST</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC1RST</name>
              <description>CRC1RST</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBHRST</name>
              <description>USBHRST</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZAHB6RSTSETR</name>
          <displayName>TZAHB6RSTSETR</displayName>
          <description>This register is used to activate the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  activates the reset of the corresponding peripheral. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDMARST</name>
              <description>MDMARST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZAHB6RSTCLRR</name>
          <displayName>TZAHB6RSTCLRR</displayName>
          <description>This register is used to release the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  releases the reset of the corresponding peripheral. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDMARST</name>
              <description>MDMARST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
