knieriem/tinygo-stm32-svd/svd/stm32mp157.svd
        <register>
          <name>MP_APB5LPENCLRR</name>
          <displayName>MP_APB5LPENCLRR</displayName>
          <description>This register is used by the Mpu.</description>
          <addressOffset>0x30C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0011391D</resetValue>
          <fields>
            <field>
              <name>SPI6LPEN</name>
              <description>SPI6LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C4LPEN</name>
              <description>I2C4LPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C6LPEN</name>
              <description>I2C6LPEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1LPEN</name>
              <description>USART1LPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBLPEN</name>
              <description>RTCAPBLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZC1LPEN</name>
              <description>TZC1LPEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZC2LPEN</name>
              <description>TZC2LPEN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZPCLPEN</name>
              <description>TZPCLPEN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG1APBLPEN</name>
              <description>IWDG1APBLPEN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSECLPEN</name>
              <description>BSECLPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STGENLPEN</name>
              <description>STGENLPEN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STGENSTPEN</name>
              <description>STGENSTPEN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_AHB5LPENSETR</name>
          <displayName>MP_AHB5LPENSETR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bits If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000171</resetValue>
          <fields>
            <field>
              <name>GPIOZLPEN</name>
              <description>GPIOZLPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRYP1LPEN</name>
              <description>CRYP1LPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HASH1LPEN</name>
              <description>HASH1LPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG1LPEN</name>
              <description>RNG1LPEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPSRAMLPEN</name>
              <description>BKPSRAMLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_AHB5LPENCLRR</name>
          <displayName>MP_AHB5LPENCLRR</displayName>
          <description>This register is used by the MCU</description>
          <addressOffset>0x314</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000171</resetValue>
          <fields>
            <field>
              <name>GPIOZLPEN</name>
              <description>GPIOZLPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRYP1LPEN</name>
              <description>CRYP1LPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HASH1LPEN</name>
              <description>HASH1LPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG1LPEN</name>
              <description>RNG1LPEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPSRAMLPEN</name>
              <description>BKPSRAMLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_AHB6LPENSETR</name>
          <displayName>MP_AHB6LPENSETR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bits</description>
          <addressOffset>0x318</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x011357A1</resetValue>
          <fields>
            <field>
              <name>MDMALPEN</name>
              <description>MDMALPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPULPEN</name>
              <description>GPULPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETHCKLPEN</name>
              <description>ETHCKLPEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETHTXLPEN</name>
              <description>ETHTXLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETHRXLPEN</name>
              <description>ETHRXLPEN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETHMACLPEN</name>
              <description>ETHMACLPEN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETHSTPEN</name>
              <description>ETHSTPEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMCLPEN</name>
              <description>FMCLPEN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPILPEN</name>
              <description>QSPILPEN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC1LPEN</name>
              <description>SDMMC1LPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC2LPEN</name>
              <description>SDMMC2LPEN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC1LPEN</name>
              <description>CRC1LPEN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBHLPEN</name>
              <description>USBHLPEN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_AHB6LPENCLRR</name>
          <displayName>MP_AHB6LPENCLRR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bits</description>
          <addressOffset>0x31C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x011357A1</resetValue>
          <fields>
            <field>
              <name>MDMALPEN</name>
              <description>MDMALPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPULPEN</name>
              <description>GPULPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETHCKLPEN</name>
              <description>ETHCKLPEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETHTXLPEN</name>
              <description>ETHTXLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETHRXLPEN</name>
              <description>ETHRXLPEN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETHMACLPEN</name>
              <description>ETHMACLPEN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETHSTPEN</name>
              <description>ETHSTPEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMCLPEN</name>
              <description>FMCLPEN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPILPEN</name>
              <description>QSPILPEN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC1LPEN</name>
              <description>SDMMC1LPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC2LPEN</name>
              <description>SDMMC2LPEN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC1LPEN</name>
              <description>CRC1LPEN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBHLPEN</name>
              <description>USBHLPEN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_TZAHB6LPENSETR</name>
          <displayName>MP_TZAHB6LPENSETR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bits If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x320</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>MDMALPEN</name>
              <description>MDMALPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_TZAHB6LPENCLRR</name>
          <displayName>MP_TZAHB6LPENCLRR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bits If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>MDMALPEN</name>
              <description>MDMALPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_APB4LPENSETR</name>
          <displayName>MC_APB4LPENSETR</displayName>
          <description>This register is used by the MCU in order to set the PERxLPEN bit.</description>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00110111</resetValue>
          <fields>
            <field>
              <name>LTDCLPEN</name>
              <description>LTDCLPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSILPEN</name>
              <description>DSILPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDRPERFMLPEN</name>
              <description>DDRPERFMLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBPHYLPEN</name>
              <description>USBPHYLPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STGENROLPEN</name>
              <description>STGENROLPEN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STGENROSTPEN</name>
              <description>STGENROSTPEN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_APB4LPENCLRR</name>
          <displayName>MC_APB4LPENCLRR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bit</description>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00110111</resetValue>
          <fields>
            <field>
              <name>LTDCLPEN</name>
              <description>LTDCLPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSILPEN</name>
              <description>DSILPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDRPERFMLPEN</name>
              <description>DDRPERFMLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBPHYLPEN</name>
              <description>USBPHYLPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STGENROLPEN</name>
              <description>STGENROLPEN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STGENROSTPEN</name>
              <description>STGENROSTPEN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_APB5LPENSETR</name>
          <displayName>MC_APB5LPENSETR</displayName>
          <description>This register is used by the MCU in order to set the PERxLPEN bit.</description>
          <addressOffset>0x388</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0011391D</resetValue>
          <fields>
            <field>
              <name>SPI6LPEN</name>
              <description>SPI6LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C4LPEN</name>
              <description>I2C4LPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C6LPEN</name>
              <description>I2C6LPEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1LPEN</name>
              <description>USART1LPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBLPEN</name>
              <description>RTCAPBLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZC1LPEN</name>
              <description>TZC1LPEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZC2LPEN</name>
              <description>TZC2LPEN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZPCLPEN</name>
              <description>TZPCLPEN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSECLPEN</name>
              <description>BSECLPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STGENLPEN</name>
              <description>STGENLPEN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STGENSTPEN</name>
              <description>STGENSTPEN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_APB5LPENCLRR</name>
          <displayName>MC_APB5LPENCLRR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bit</description>
          <addressOffset>0x38C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0011391D</resetValue>
          <fields>
            <field>
              <name>SPI6LPEN</name>
              <description>SPI6LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C4LPEN</name>
              <description>I2C4LPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C6LPEN</name>
              <description>I2C6LPEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1LPEN</name>
              <description>USART1LPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBLPEN</name>
              <description>RTCAPBLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZC1LPEN</name>
              <description>TZC1LPEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZC2LPEN</name>
              <description>TZC2LPEN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZPCLPEN</name>
              <description>TZPCLPEN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSECLPEN</name>
              <description>BSECLPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STGENLPEN</name>
              <description>STGENLPEN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STGENSTPEN</name>
              <description>STGENSTPEN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_AHB5LPENSETR</name>
          <displayName>MC_AHB5LPENSETR</displayName>
          <description>This register is used by the MCU in order to set the PERxLPEN bit. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x390</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000171</resetValue>
          <fields>
            <field>
              <name>GPIOZLPEN</name>
              <description>GPIOZLPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRYP1LPEN</name>
              <description>CRYP1LPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HASH1LPEN</name>
              <description>HASH1LPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG1LPEN</name>
              <description>RNG1LPEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPSRAMLPEN</name>
              <description>BKPSRAMLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
