knieriem/tinygo-stm32-svd/svd/stm32mp157.svd
        <register>
          <name>PWRLPDLYCR</name>
          <displayName>PWRLPDLYCR</displayName>
          <description>This register is used to program the delay between the moment where the system exits from one of the Stop modes, and the moment where it is allowed to enable the PLLs and provide a clock to bridges and processors. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PWRLP_DLY</name>
              <description>PWRLP_DLY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
            </field>
            <field>
              <name>MCTMPSKP</name>
              <description>MCTMPSKP</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_RSTSSETR</name>
          <displayName>MP_RSTSSETR</displayName>
          <description>This register is dedicated to the BOOTROM code in order to update the reset source. This register is updated by the BOOTROM code, after a power-on reset (por_rst), a system reset (nreset), or an exit from Standby or CStandby. The application software shall not use this register. In order to identify the reset source, the MPU application must use RCC MPU Reset Status Clear Register (RCC_MP_RSTSCLRR), and the MCU application must use the RCC MCU Reset Status Clear Register (RCC_MC_RSTSCLRR).Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to .Refer to Section10.3.13: Reset source identification for details.The register is located in VDDCORE.If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PORRSTF</name>
              <description>PORRSTF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BORRSTF</name>
              <description>BORRSTF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PADRSTF</name>
              <description>PADRSTF</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HCSSRSTF</name>
              <description>HCSSRSTF</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VCORERSTF</name>
              <description>VCORERSTF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPSYSRSTF</name>
              <description>MPSYSRSTF</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCSYSRSTF</name>
              <description>MCSYSRSTF</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG1RSTF</name>
              <description>IWDG1RSTF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG2RSTF</name>
              <description>IWDG2RSTF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STDBYRSTF</name>
              <description>STDBYRSTF</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSTDBYRSTF</name>
              <description>CSTDBYRSTF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPUP0RSTF</name>
              <description>MPUP0RSTF</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPUP1RSTF</name>
              <description>MPUP1RSTF</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPARE</name>
              <description>SPARE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MCO1CFGR</name>
          <displayName>MCO1CFGR</displayName>
          <description>This register is used to select the clock generated on MCO1 output.</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCO1SEL</name>
              <description>MCO1SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCO1DIV</name>
              <description>MCO1DIV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO1ON</name>
              <description>MCO1ON</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MCO2CFGR</name>
          <displayName>MCO2CFGR</displayName>
          <description>This register is used to select the clock generated on MCO2 output.</description>
          <addressOffset>0x804</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCO2SEL</name>
              <description>MCO2SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCO2DIV</name>
              <description>MCO2DIV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO2ON</name>
              <description>MCO2ON</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OCRDYR</name>
          <displayName>OCRDYR</displayName>
          <description>This is a read-only access register, It contains the status flags of oscillators. Writing has no effect.</description>
          <addressOffset>0x808</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HSIRDY</name>
              <description>HSIRDY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIDIVRDY</name>
              <description>HSIDIVRDY</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIRDY</name>
              <description>CSIRDY</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDY</name>
              <description>HSERDY</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPUCKRDY</name>
              <description>MPUCKRDY</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXICKRDY</name>
              <description>AXICKRDY</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKREST</name>
              <description>CKREST</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCFGR</name>
          <displayName>DBGCFGR</displayName>
          <description>This is register contains the enable control of the debug and trace function, and the clock divider for the trace function.</description>
          <addressOffset>0x80C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>TRACEDIV</name>
              <description>TRACEDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DBGCKEN</name>
              <description>DBGCKEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRACECKEN</name>
              <description>TRACECKEN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBGRST</name>
              <description>DBGRST</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCK3SELR</name>
          <displayName>RCK3SELR</displayName>
          <description>This register is used to select the reference clock for PLL3. If TZEN = MCKPROT = , this register can only be modified in secure mode.</description>
          <addressOffset>0x820</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>PLL3SRC</name>
              <description>PLL3SRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3SRCRDY</name>
              <description>PLL3SRCRDY</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCK4SELR</name>
          <displayName>RCK4SELR</displayName>
          <description>This register is used to select the reference clock for PLL4.</description>
          <addressOffset>0x824</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>PLL4SRC</name>
              <description>PLL4SRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL4SRCRDY</name>
              <description>PLL4SRCRDY</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMG1PRER</name>
          <displayName>TIMG1PRER</displayName>
          <description>This register is used to control the prescaler value of timers located into APB1 domain. It concerns TIM2, TIM3, TIM4, TIM5, TIM6, TIM7, TIM12, TIM13 and TIM14. Refer to Section: Sub-system clock generation for additional information.</description>
          <addressOffset>0x828</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>TIMG1PRE</name>
              <description>TIMG1PRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMG1PRERDY</name>
              <description>TIMG1PRERDY</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMG2PRER</name>
          <displayName>TIMG2PRER</displayName>
          <description>This register is used to control the prescaler value of timers located into APB2 domain. It concerns TIM1, TIM8, TIM15, TIM16, and TIM17. Refer to Section: Sub-system clock generation for additional information.</description>
          <addressOffset>0x82C</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>TIMG2PRE</name>
              <description>TIMG2PRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMG2PRERDY</name>
              <description>TIMG2PRERDY</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUDIVR</name>
          <displayName>MCUDIVR</displayName>
          <description>This register is used to control the MCU sub-system clock prescaler. Refer to Section: Sub-system clock generation for additional information. If TZEN = , this register can only be modified in secure mode.</description>
          <addressOffset>0x830</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>MCUDIV</name>
              <description>MCUDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCUDIVRDY</name>
              <description>MCUDIVRDY</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1DIVR</name>
          <displayName>APB1DIVR</displayName>
          <description>This register is used to control the APB1 clock prescaler. Refer to section Section1.4.6.3: Sub-System Clock Generation for additional information.</description>
          <addressOffset>0x834</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>APB1DIV</name>
              <description>APB1DIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB1DIVRDY</name>
              <description>APB1DIVRDY</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2DIVR</name>
          <displayName>APB2DIVR</displayName>
          <description>This register is used to control the APB2 clock prescaler. Refer to Section: Sub-system clock generation for additional information.</description>
          <addressOffset>0x838</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>APB2DIV</name>
              <description>APB2DIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB2DIVRDY</name>
              <description>APB2DIVRDY</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB3DIVR</name>
          <displayName>APB3DIVR</displayName>
          <description>This register is used to control the APB3 clock prescaler. Refer to Section: Sub-system clock generation for additional information.</description>
          <addressOffset>0x83C</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>APB3DIV</name>
              <description>APB3DIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB3DIVRDY</name>
              <description>APB3DIVRDY</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3CR</name>
          <displayName>PLL3CR</displayName>
          <description>This register is used to control the PLL3. If TZEN = MCKPROT = , this register can only be modified in secure mode.</description>
          <addressOffset>0x880</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PLLON</name>
              <description>PLLON</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3RDY</name>
              <description>PLL3RDY</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSCG_CTRL</name>
              <description>SSCG_CTRL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVPEN</name>
              <description>DIVPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVQEN</name>
              <description>DIVQEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVREN</name>
              <description>DIVREN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3CFGR1</name>
          <displayName>PLL3CFGR1</displayName>
          <description>This register is used to configure the PLL3. If TZEN = MCKPROT = , this register can only be modified in secure mode.</description>
          <addressOffset>0x884</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010031</resetValue>
          <fields>
            <field>
              <name>DIVN</name>
              <description>DIVN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DIVM3</name>
              <description>DIVM3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IFRGE</name>
              <description>IFRGE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3CFGR2</name>
          <displayName>PLL3CFGR2</displayName>
          <description>This register is used to configure the PLL3. If TZEN = MCKPROT = , this register can only be modified in secure mode.</description>
          <addressOffset>0x888</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010101</resetValue>
          <fields>
            <field>
              <name>DIVP</name>
              <description>DIVP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVQ</name>
              <description>DIVQ</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVR</name>
              <description>DIVR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3FRACR</name>
          <displayName>PLL3FRACR</displayName>
          <description>This register is used to fine-tune the frequency of the PLL3 VCO. If TZEN = MCKPROT = , this register can only be modified in secure mode.</description>
          <addressOffset>0x88C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRACV</name>
              <description>FRACV</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>FRACLE</name>
              <description>FRACLE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
