knieriem/tinygo-stm32-svd/svd/stm32mp157.svd
        <register>
          <name>MP_APB2LPENCLRR</name>
          <displayName>MP_APB2LPENCLRR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bits</description>
          <addressOffset>0xB0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0137271F</resetValue>
          <fields>
            <field>
              <name>TIM1LPEN</name>
              <description>TIM1LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM8LPEN</name>
              <description>TIM8LPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM15LPEN</name>
              <description>TIM15LPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM16LPEN</name>
              <description>TIM16LPEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM17LPEN</name>
              <description>TIM17LPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1LPEN</name>
              <description>SPI1LPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI4LPEN</name>
              <description>SPI4LPEN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI5LPEN</name>
              <description>SPI5LPEN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART6LPEN</name>
              <description>USART6LPEN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAI1LPEN</name>
              <description>SAI1LPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAI2LPEN</name>
              <description>SAI2LPEN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAI3LPEN</name>
              <description>SAI3LPEN</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFSDMLPEN</name>
              <description>DFSDMLPEN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADFSDMLPEN</name>
              <description>ADFSDMLPEN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDCANLPEN</name>
              <description>FDCANLPEN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_APB3LPENSETR</name>
          <displayName>MP_APB3LPENSETR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bits</description>
          <addressOffset>0xB10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0003290F</resetValue>
          <fields>
            <field>
              <name>LPTIM2LPEN</name>
              <description>LPTIM2LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3LPEN</name>
              <description>LPTIM3LPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM4LPEN</name>
              <description>LPTIM4LPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM5LPEN</name>
              <description>LPTIM5LPEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAI4LPEN</name>
              <description>SAI4LPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSCFGLPEN</name>
              <description>SYSCFGLPEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFLPEN</name>
              <description>VREFLPEN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTSLPEN</name>
              <description>DTSLPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_APB3LPENCLRR</name>
          <displayName>MP_APB3LPENCLRR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bits</description>
          <addressOffset>0xB14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0003290F</resetValue>
          <fields>
            <field>
              <name>LPTIM2LPEN</name>
              <description>LPTIM2LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3LPEN</name>
              <description>LPTIM3LPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM4LPEN</name>
              <description>LPTIM4LPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM5LPEN</name>
              <description>LPTIM5LPEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAI4LPEN</name>
              <description>SAI4LPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSCFGLPEN</name>
              <description>SYSCFGLPEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFLPEN</name>
              <description>VREFLPEN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTSLPEN</name>
              <description>DTSLPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_AHB2LPENSETR</name>
          <displayName>MP_AHB2LPENSETR</displayName>
          <description>This register is used by the MPU in order to set the PERxLPEN bit.</description>
          <addressOffset>0xB18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010127</resetValue>
          <fields>
            <field>
              <name>DMA1LPEN</name>
              <description>DMA1LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2LPEN</name>
              <description>DMA2LPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAMUXLPEN</name>
              <description>DMAMUXLPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC12LPEN</name>
              <description>ADC12LPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBOLPEN</name>
              <description>USBOLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC3LPEN</name>
              <description>SDMMC3LPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_AHB2LPENCLRR</name>
          <displayName>MP_AHB2LPENCLRR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bits</description>
          <addressOffset>0xB1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010127</resetValue>
          <fields>
            <field>
              <name>DMA1LPEN</name>
              <description>DMA1LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2LPEN</name>
              <description>DMA2LPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAMUXLPEN</name>
              <description>DMAMUXLPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC12LPEN</name>
              <description>ADC12LPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBOLPEN</name>
              <description>USBOLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC3LPEN</name>
              <description>SDMMC3LPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_AHB3LPENSETR</name>
          <displayName>MP_AHB3LPENSETR</displayName>
          <description>This register is used by the MPU</description>
          <addressOffset>0xB20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000018F1</resetValue>
          <fields>
            <field>
              <name>DCMILPEN</name>
              <description>DCMILPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRYP2LPEN</name>
              <description>CRYP2LPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HASH2LPEN</name>
              <description>HASH2LPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG2LPEN</name>
              <description>RNG2LPEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC2LPEN</name>
              <description>CRC2LPEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEMLPEN</name>
              <description>HSEMLPEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPCCLPEN</name>
              <description>IPCCLPEN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_AHB3LPENCLRR</name>
          <displayName>MP_AHB3LPENCLRR</displayName>
          <description>This register is used by the MPU in order to clear the PERxLPEN bit</description>
          <addressOffset>0xB24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000018F1</resetValue>
          <fields>
            <field>
              <name>DCMILPEN</name>
              <description>DCMILPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRYP2LPEN</name>
              <description>CRYP2LPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HASH2LPEN</name>
              <description>HASH2LPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG2LPEN</name>
              <description>RNG2LPEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC2LPEN</name>
              <description>CRC2LPEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEMLPEN</name>
              <description>HSEMLPEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPCCLPEN</name>
              <description>IPCCLPEN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_AHB4LPENSETR</name>
          <displayName>MP_AHB4LPENSETR</displayName>
          <description>This register is used by the MPU</description>
          <addressOffset>0xB28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000007FF</resetValue>
          <fields>
            <field>
              <name>GPIOALPEN</name>
              <description>GPIOALPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOBLPEN</name>
              <description>GPIOBLPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOCLPEN</name>
              <description>GPIOCLPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIODLPEN</name>
              <description>GPIODLPEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOELPEN</name>
              <description>GPIOELPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOFLPEN</name>
              <description>GPIOFLPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOGLPEN</name>
              <description>GPIOGLPEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOHLPEN</name>
              <description>GPIOHLPEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOILPEN</name>
              <description>GPIOILPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOJLPEN</name>
              <description>GPIOJLPEN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOKLPEN</name>
              <description>GPIOKLPEN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_AHB4LPENCLRR</name>
          <displayName>MP_AHB4LPENCLRR</displayName>
          <description>This register is used by the MPU</description>
          <addressOffset>0xB2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000007FF</resetValue>
          <fields>
            <field>
              <name>GPIOALPEN</name>
              <description>GPIOALPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOBLPEN</name>
              <description>GPIOBLPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOCLPEN</name>
              <description>GPIOCLPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIODLPEN</name>
              <description>GPIODLPEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOELPEN</name>
              <description>GPIOELPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOFLPEN</name>
              <description>GPIOFLPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOGLPEN</name>
              <description>GPIOGLPEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOHLPEN</name>
              <description>GPIOHLPEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOILPEN</name>
              <description>GPIOILPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOJLPEN</name>
              <description>GPIOJLPEN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOKLPEN</name>
              <description>GPIOKLPEN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_AXIMLPENSETR</name>
          <displayName>MP_AXIMLPENSETR</displayName>
          <description>This register is used by the MPU</description>
          <addressOffset>0xB30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SYSRAMLPEN</name>
              <description>SYSRAMLPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_AXIMLPENCLRR</name>
          <displayName>MP_AXIMLPENCLRR</displayName>
          <description>This register is used by the MPU</description>
          <addressOffset>0xB34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SYSRAMLPEN</name>
              <description>SYSRAMLPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_MLAHBLPENSETR</name>
          <displayName>MP_MLAHBLPENSETR</displayName>
          <description>This register is used by the MPU in order to set the PERxLPEN bit</description>
          <addressOffset>0xB38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000017</resetValue>
          <fields>
            <field>
              <name>SRAM1LPEN</name>
              <description>SRAM1LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2LPEN</name>
              <description>SRAM2LPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM34LPEN</name>
              <description>SRAM34LPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRAMLPEN</name>
              <description>RETRAMLPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_MLAHBLPENCLRR</name>
          <displayName>MP_MLAHBLPENCLRR</displayName>
          <description>This register is used by the MPU in order to clear the PERxLPEN bit</description>
          <addressOffset>0xB3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000017</resetValue>
          <fields>
            <field>
              <name>SRAM1LPEN</name>
              <description>SRAM1LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2LPEN</name>
              <description>SRAM2LPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM34LPEN</name>
              <description>SRAM34LPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRAMLPEN</name>
              <description>RETRAMLPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
