knieriem/tinygo-stm32-svd/svd/stm32mp157.svd
        <register>
          <name>MC_AHB2LPENSETR</name>
          <displayName>MC_AHB2LPENSETR</displayName>
          <description>This register is used by the MCU in order to set the PERxLPEN bit.</description>
          <addressOffset>0xB98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010127</resetValue>
          <fields>
            <field>
              <name>DMA1LPEN</name>
              <description>DMA1LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2LPEN</name>
              <description>DMA2LPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAMUXLPEN</name>
              <description>DMAMUXLPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC12LPEN</name>
              <description>ADC12LPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBOLPEN</name>
              <description>USBOLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC3LPEN</name>
              <description>SDMMC3LPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_AHB2LPENCLRR</name>
          <displayName>MC_AHB2LPENCLRR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bit</description>
          <addressOffset>0xB9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010127</resetValue>
          <fields>
            <field>
              <name>DMA1LPEN</name>
              <description>DMA1LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2LPEN</name>
              <description>DMA2LPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAMUXLPEN</name>
              <description>DMAMUXLPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC12LPEN</name>
              <description>ADC12LPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBOLPEN</name>
              <description>USBOLPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC3LPEN</name>
              <description>SDMMC3LPEN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_AHB3LPENSETR</name>
          <displayName>MC_AHB3LPENSETR</displayName>
          <description>This register is used by the MCU in order to set the PERxLPEN bit.</description>
          <addressOffset>0xBA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000018F1</resetValue>
          <fields>
            <field>
              <name>DCMILPEN</name>
              <description>DCMILPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRYP2LPEN</name>
              <description>CRYP2LPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HASH2LPEN</name>
              <description>HASH2LPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG2LPEN</name>
              <description>RNG2LPEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC2LPEN</name>
              <description>CRC2LPEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEMLPEN</name>
              <description>HSEMLPEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPCCLPEN</name>
              <description>IPCCLPEN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_AHB3LPENCLRR</name>
          <displayName>MC_AHB3LPENCLRR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bit</description>
          <addressOffset>0xBA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000018F1</resetValue>
          <fields>
            <field>
              <name>DCMILPEN</name>
              <description>DCMILPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRYP2LPEN</name>
              <description>CRYP2LPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HASH2LPEN</name>
              <description>HASH2LPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG2LPEN</name>
              <description>RNG2LPEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC2LPEN</name>
              <description>CRC2LPEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEMLPEN</name>
              <description>HSEMLPEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPCCLPEN</name>
              <description>IPCCLPEN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_AHB4LPENSETR</name>
          <displayName>MC_AHB4LPENSETR</displayName>
          <description>This register is used by the MCU in order to set the PERxLPEN bit.</description>
          <addressOffset>0xBA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000007FF</resetValue>
          <fields>
            <field>
              <name>GPIOALPEN</name>
              <description>GPIOALPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOBLPEN</name>
              <description>GPIOBLPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOCLPEN</name>
              <description>GPIOCLPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIODLPEN</name>
              <description>GPIODLPEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOELPEN</name>
              <description>GPIOELPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOFLPEN</name>
              <description>GPIOFLPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOGLPEN</name>
              <description>GPIOGLPEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOHLPEN</name>
              <description>GPIOHLPEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOILPEN</name>
              <description>GPIOILPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOJLPEN</name>
              <description>GPIOJLPEN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOKLPEN</name>
              <description>GPIOKLPEN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_AHB4LPENCLRR</name>
          <displayName>MC_AHB4LPENCLRR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bit of the corresponding peripheral.</description>
          <addressOffset>0xBAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000007FF</resetValue>
          <fields>
            <field>
              <name>GPIOALPEN</name>
              <description>GPIOALPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOBLPEN</name>
              <description>GPIOBLPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOCLPEN</name>
              <description>GPIOCLPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIODLPEN</name>
              <description>GPIODLPEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOELPEN</name>
              <description>GPIOELPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOFLPEN</name>
              <description>GPIOFLPEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOGLPEN</name>
              <description>GPIOGLPEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOHLPEN</name>
              <description>GPIOHLPEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOILPEN</name>
              <description>GPIOILPEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOJLPEN</name>
              <description>GPIOJLPEN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOKLPEN</name>
              <description>GPIOKLPEN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_AXIMLPENSETR</name>
          <displayName>MC_AXIMLPENSETR</displayName>
          <description>This register is used by the MCU in order to set the PERxLPEN bit of the corresponding peripheral.</description>
          <addressOffset>0xBB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SYSRAMLPEN</name>
              <description>SYSRAMLPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_AXIMLPENCLRR</name>
          <displayName>MC_AXIMLPENCLRR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bit of the corresponding peripheral.</description>
          <addressOffset>0xBB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SYSRAMLPEN</name>
              <description>SYSRAMLPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_MLAHBLPENSETR</name>
          <displayName>MC_MLAHBLPENSETR</displayName>
          <description>This register is used by the MCU in order to set the PERxLPEN bit of the corresponding peripheral.</description>
          <addressOffset>0xBB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000017</resetValue>
          <fields>
            <field>
              <name>SRAM1LPEN</name>
              <description>SRAM1LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2LPEN</name>
              <description>SRAM2LPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM34LPEN</name>
              <description>SRAM34LPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRAMLPEN</name>
              <description>RETRAMLPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_MLAHBLPENCLRR</name>
          <displayName>MC_MLAHBLPENCLRR</displayName>
          <description>This register is used by the MCU in order to clear the PERxLPEN bit of the corresponding peripheral.</description>
          <addressOffset>0xBBC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000017</resetValue>
          <fields>
            <field>
              <name>SRAM1LPEN</name>
              <description>SRAM1LPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2LPEN</name>
              <description>SRAM2LPEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM34LPEN</name>
              <description>SRAM34LPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRAMLPEN</name>
              <description>RETRAMLPEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_RSTSCLRR</name>
          <displayName>MC_RSTSCLRR</displayName>
          <description>This register is used by the MCU to check the reset source.</description>
          <addressOffset>0xC00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000015</resetValue>
          <fields>
            <field>
              <name>PORRSTF</name>
              <description>PORRSTF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BORRSTF</name>
              <description>BORRSTF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PADRSTF</name>
              <description>PADRSTF</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HCSSRSTF</name>
              <description>HCSSRSTF</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VCORERSTF</name>
              <description>VCORERSTF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCURSTF</name>
              <description>MCURSTF</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPSYSRSTF</name>
              <description>MPSYSRSTF</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCSYSRSTF</name>
              <description>MCSYSRSTF</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG1RSTF</name>
              <description>IWDG1RSTF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG2RSTF</name>
              <description>IWDG2RSTF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDG1RSTF</name>
              <description>WWDG1RSTF</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MC_CIER</name>
          <displayName>MC_CIER</displayName>
          <description>This register shall be used by the MCU to control the interrupt source enable. Refer to Section10.5: RCC interrupts for more details.</description>
          <addressOffset>0xC14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <description>LSIRDYIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>LSERDYIE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>HSIRDYIE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>HSERDYIE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIRDYIE</name>
              <description>CSIRDYIE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1DYIE</name>
              <description>PLL1DYIE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2DYIE</name>
              <description>PLL2DYIE</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3DYIE</name>
              <description>PLL3DYIE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL4DYIE</name>
              <description>PLL4DYIE</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSECSSIE</name>
              <description>LSECSSIE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPIE</name>
              <description>WKUPIE</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
