knieriem/tinygo-stm32-svd/svd/stm32mp157.svd
        <register>
          <name>PID1</name>
          <displayName>PID1</displayName>
          <description>Peripheral ID 1.</description>
          <addressOffset>0xFE4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000B4</resetValue>
          <fields>
            <field>
              <name>PER_ID_1</name>
              <description>PER_ID_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PID2</name>
          <displayName>PID2</displayName>
          <description>Peripheral ID 2.</description>
          <addressOffset>0xFE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000002B</resetValue>
          <fields>
            <field>
              <name>PER_ID_2</name>
              <description>PER_ID_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PID3</name>
          <displayName>PID3</displayName>
          <description>Peripheral ID 3.</description>
          <addressOffset>0xFEC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PER_ID_3</name>
              <description>PER_ID_3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID0</name>
          <displayName>CID0</displayName>
          <description>Component ID 0.</description>
          <addressOffset>0xFF0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>COMP_ID_0</name>
              <description>COMP_ID_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID1</name>
          <displayName>CID1</displayName>
          <description>Component ID 1.</description>
          <addressOffset>0xFF4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000F0</resetValue>
          <fields>
            <field>
              <name>COMP_ID_1</name>
              <description>COMP_ID_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID2</name>
          <displayName>CID2</displayName>
          <description>Component ID 2.</description>
          <addressOffset>0xFF8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>COMP_ID_2</name>
              <description>COMP_ID_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID3</name>
          <displayName>CID3</displayName>
          <description>Component ID 3.</description>
          <addressOffset>0xFFC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>COMP_ID_3</name>
              <description>COMP_ID_3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAIL_ADDRESS_LOW0</name>
          <displayName>FAIL_ADDRESS_LOW0</displayName>
          <description>Address low bits of the first failed access in the associated filter (0 to 1).</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR_STATUS_LOW</name>
              <description>ADDR_STATUS_LOW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAIL_ADDRESS_HIGH0</name>
          <displayName>FAIL_ADDRESS_HIGH0</displayName>
          <description>Address high bit of the first failed access in the associated filter (0 to 1).
Not used with 32bit address.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>FAIL_ADDRESS_LOW1</name>
          <displayName>FAIL_ADDRESS_LOW1</displayName>
          <description>Address low bits of the first failed access in the associated filter (0 to 1).</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR_STATUS_LOW</name>
              <description>ADDR_STATUS_LOW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAIL_ADDRESS_HIGH1</name>
          <displayName>FAIL_ADDRESS_HIGH1</displayName>
          <description>Address high bit of the first failed access in the associated filter (0 to 1).
Not used with 32bit address.</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_BASE_HIGH0</name>
          <displayName>REGION_BASE_HIGH0</displayName>
          <description>Base address high are not used with 32-bit address.</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_TOP_LOW0</name>
          <displayName>REGION_TOP_LOW0</displayName>
          <description>Top address bits [31:12] for region 0.</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>TOP_ADDRESS_LOW</name>
              <description>TOP_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_TOP_HIGH0</name>
          <displayName>REGION_TOP_HIGH0</displayName>
          <description>Top address high of region are not used with 32-bit address.</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_ID_ACCESS0</name>
          <displayName>REGION_ID_ACCESS0</displayName>
          <description>Region non-secure access based on NSAID.</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSAID_RD_EN</name>
              <description>NSAID_RD_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSAID_WR_EN</name>
              <description>NSAID_WR_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_LOW1</name>
          <displayName>REGION_BASE_LOW1</displayName>
          <description>Base address low for regions 1 to 8.</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BASE_ADDRESS_LOW</name>
              <description>BASE_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_HIGH1</name>
          <displayName>REGION_BASE_HIGH1</displayName>
          <description>Base address high are not used with 32-bit address.</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_TOP_LOW1</name>
          <displayName>REGION_TOP_LOW1</displayName>
          <description>Top address bits [31:12] for region x.</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>TOP_ADDRESS_LOW</name>
              <description>TOP_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_TOP_HIGH1</name>
          <displayName>REGION_TOP_HIGH1</displayName>
          <description>Top address high of region are not used with 32-bit address.</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_ID_ACCESS1</name>
          <displayName>REGION_ID_ACCESS1</displayName>
          <description>Region non-secure access based on NSAID.</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSAID_RD_EN</name>
              <description>NSAID_RD_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSAID_WR_EN</name>
              <description>NSAID_WR_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_LOW2</name>
          <displayName>REGION_BASE_LOW2</displayName>
          <description>Base address low for regions 1 to 8.</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BASE_ADDRESS_LOW</name>
              <description>BASE_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_HIGH2</name>
          <displayName>REGION_BASE_HIGH2</displayName>
          <description>Base address high are not used with 32-bit address.</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_TOP_LOW2</name>
          <displayName>REGION_TOP_LOW2</displayName>
          <description>Top address bits [31:12] for region x.</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>TOP_ADDRESS_LOW</name>
              <description>TOP_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_TOP_HIGH2</name>
          <displayName>REGION_TOP_HIGH2</displayName>
          <description>Top address high of region are not used with 32-bit address.</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_ID_ACCESS2</name>
          <displayName>REGION_ID_ACCESS2</displayName>
          <description>Region non-secure access based on NSAID.</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSAID_RD_EN</name>
              <description>NSAID_RD_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSAID_WR_EN</name>
              <description>NSAID_WR_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_LOW3</name>
          <displayName>REGION_BASE_LOW3</displayName>
          <description>Base address low for regions 1 to 8.</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BASE_ADDRESS_LOW</name>
              <description>BASE_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_HIGH3</name>
          <displayName>REGION_BASE_HIGH3</displayName>
          <description>Base address high are not used with 32-bit address.</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_TOP_LOW3</name>
          <displayName>REGION_TOP_LOW3</displayName>
          <description>Top address bits [31:12] for region x.</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>TOP_ADDRESS_LOW</name>
              <description>TOP_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_TOP_HIGH3</name>
          <displayName>REGION_TOP_HIGH3</displayName>
          <description>Top address high of region are not used with 32-bit address.</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_ID_ACCESS3</name>
          <displayName>REGION_ID_ACCESS3</displayName>
          <description>Region non-secure access based on NSAID.</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSAID_RD_EN</name>
              <description>NSAID_RD_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSAID_WR_EN</name>
              <description>NSAID_WR_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_LOW4</name>
          <displayName>REGION_BASE_LOW4</displayName>
          <description>Base address low for regions 1 to 8.</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BASE_ADDRESS_LOW</name>
              <description>BASE_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_HIGH4</name>
          <displayName>REGION_BASE_HIGH4</displayName>
          <description>Base address high are not used with 32-bit address.</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_TOP_LOW4</name>
          <displayName>REGION_TOP_LOW4</displayName>
          <description>Top address bits [31:12] for region x.</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>TOP_ADDRESS_LOW</name>
              <description>TOP_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_TOP_HIGH4</name>
          <displayName>REGION_TOP_HIGH4</displayName>
          <description>Top address high of region are not used with 32-bit address.</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_ID_ACCESS4</name>
          <displayName>REGION_ID_ACCESS4</displayName>
          <description>Region non-secure access based on NSAID.</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSAID_RD_EN</name>
              <description>NSAID_RD_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSAID_WR_EN</name>
              <description>NSAID_WR_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_LOW5</name>
          <displayName>REGION_BASE_LOW5</displayName>
          <description>Base address low for regions 1 to 8.</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BASE_ADDRESS_LOW</name>
              <description>BASE_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_HIGH5</name>
          <displayName>REGION_BASE_HIGH5</displayName>
          <description>Base address high are not used with 32-bit address.</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_TOP_LOW5</name>
          <displayName>REGION_TOP_LOW5</displayName>
          <description>Top address bits [31:12] for region x.</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>TOP_ADDRESS_LOW</name>
              <description>TOP_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_TOP_HIGH5</name>
          <displayName>REGION_TOP_HIGH5</displayName>
          <description>Top address high of region are not used with 32-bit address.</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_ID_ACCESS5</name>
          <displayName>REGION_ID_ACCESS5</displayName>
          <description>Region non-secure access based on NSAID.</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSAID_RD_EN</name>
              <description>NSAID_RD_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSAID_WR_EN</name>
              <description>NSAID_WR_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
