knieriem/tinygo-stm32-svd/svd/stm32mp157.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART2</name>
      <baseAddress>0x4000E000</baseAddress>
      <interrupt>
        <name>USART2</name>
        <description>USART2 global interrupt</description>
        <value>38</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART3</name>
      <baseAddress>0x4000F000</baseAddress>
      <interrupt>
        <name>USART3</name>
        <description>USART3 global interrupt</description>
        <value>39</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART4</name>
      <baseAddress>0x40010000</baseAddress>
      <interrupt>
        <name>USART4</name>
        <description>USART4 global interrupt</description>
        <value>52</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART5</name>
      <baseAddress>0x40011000</baseAddress>
      <interrupt>
        <name>USART5</name>
        <description>USART5 global interrupt</description>
        <value>53</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART6</name>
      <baseAddress>0x44003000</baseAddress>
      <interrupt>
        <name>USART6</name>
        <description>USART6 global interrupt</description>
        <value>71</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART7</name>
      <baseAddress>0x40018000</baseAddress>
      <interrupt>
        <name>USART7</name>
        <description>USART7 global interrupt</description>
        <value>82</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART8</name>
      <baseAddress>0x40019000</baseAddress>
      <interrupt>
        <name>USART8</name>
        <description>USART8 global interrupt</description>
        <value>83</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>USBPHYC</name>
      <description>USBPHYC</description>
      <groupName>USBPHYC</groupName>
      <baseAddress>0x5A006000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PLL</name>
          <displayName>PLL</displayName>
          <description>This register is used to control the PLL of the HS PHY.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <fields>
            <field>
              <name>PLLNDIV</name>
              <description>PLLNDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>PLLODF</name>
              <description>PLLODF</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PLLFRACIN</name>
              <description>PLLFRACIN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PLLEN</name>
              <description>PLLEN</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLSTRB</name>
              <description>PLLSTRB</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLSTRBYP</name>
              <description>PLLSTRBYP</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLFRACCTL</name>
              <description>PLLFRACCTL</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLDITHEN0</name>
              <description>PLLDITHEN0</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLDITHEN1</name>
              <description>PLLDITHEN1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <displayName>MISC</displayName>
          <description>This register is used to control the switch between controllers for the HS PHY.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWITHOST</name>
              <description>SWITHOST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPCKDIS</name>
              <description>PPCKDIS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TUNE1</name>
          <displayName>TUNE1</displayName>
          <description>This register is used to control the tune interface of the HS PHY, port #x.</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x04070004</resetValue>
          <fields>
            <field>
              <name>INCURREN</name>
              <description>INCURREN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INCURRINT</name>
              <description>INCURRINT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LFSCAPEN</name>
              <description>LFSCAPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSDRVSLEW</name>
              <description>HSDRVSLEW</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSDRVDCCUR</name>
              <description>HSDRVDCCUR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSDRVDCLEV</name>
              <description>HSDRVDCLEV</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSDRVCURINCR</name>
              <description>HSDRVCURINCR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSDRVRFADJ</name>
              <description>FSDRVRFADJ</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSDRVRFRED</name>
              <description>HSDRVRFRED</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSDRVCHKITRM</name>
              <description>HSDRVCHKITRM</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HSDRVCHKZTRM</name>
              <description>HSDRVCHKZTRM</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OTPCOMP</name>
              <description>OTPCOMP</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQLCHCTL</name>
              <description>SQLCHCTL</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HDRXGNEQEN</name>
              <description>HDRXGNEQEN</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSRXOFF</name>
              <description>HSRXOFF</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HSFALLPREEM</name>
              <description>HSFALLPREEM</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHTCCTCTLPROT</name>
              <description>SHTCCTCTLPROT</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STAGSEL</name>
              <description>STAGSEL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TUNE2</name>
          <displayName>TUNE2</displayName>
          <description>This register is used to control the tune interface of the HS PHY, port #x.</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x04070004</resetValue>
          <fields>
            <field>
              <name>INCURREN</name>
              <description>INCURREN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INCURRINT</name>
              <description>INCURRINT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LFSCAPEN</name>
              <description>LFSCAPEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSDRVSLEW</name>
              <description>HSDRVSLEW</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSDRVDCCUR</name>
              <description>HSDRVDCCUR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSDRVDCLEV</name>
              <description>HSDRVDCLEV</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSDRVCURINCR</name>
              <description>HSDRVCURINCR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSDRVRFADJ</name>
              <description>FSDRVRFADJ</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSDRVRFRED</name>
              <description>HSDRVRFRED</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSDRVCHKITRM</name>
              <description>HSDRVCHKITRM</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HSDRVCHKZTRM</name>
              <description>HSDRVCHKZTRM</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OTPCOMP</name>
              <description>OTPCOMP</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQLCHCTL</name>
              <description>SQLCHCTL</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HDRXGNEQEN</name>
              <description>HDRXGNEQEN</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSRXOFF</name>
              <description>HSRXOFF</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HSFALLPREEM</name>
              <description>HSFALLPREEM</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHTCCTCTLPROT</name>
              <description>SHTCCTCTLPROT</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STAGSEL</name>
              <description>STAGSEL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VERR</name>
          <displayName>VERR</displayName>
          <description>This register defines the version of this IP.</description>
          <addressOffset>0xFFC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>MINREV</name>
              <description>MINREV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>MAJREV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
